# Book Data Linkage Statistics

This notebook presents linkage statistics for the book data integration.

## Setup

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
from support import db_url

## ISBN Statistics

How many ISBNs do we have in the database?

In [6]:
pd.read_sql('''
SELECT COUNT(*) FROM isbn_id
''', db_url())

      count
0  22136707

How many ISBN clusters?

In [5]:
pd.read_sql('''
SELECT COUNT(DISTINCT cluster) FROM isbn_cluster
''', db_url())

      count
0  10735373

How many resolved books from LOC?

In [8]:
pd.read_sql('''
WITH rec_lc AS (SELECT rec_id, COUNT(isbn_id) AS isbc FROM locmds.book_rec_isbn GROUP BY rec_id)
SELECT COUNT(rec_id), COUNT(isbc)
FROM locmds.book LEFT OUTER JOIN rec_lc USING (rec_id)
''', db_url())

     count    count
0  9244676  5246932